Diplom/src/Documents/ВКМ_ГрафикОтпусков/ВКМ_ГрафикОтпусков.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>ВКМ_ГрафикОтпусков</name>
  <attributes>
    <name>ВКМ_Год</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>4</length>
      </stringQualifiers>
    </type>
  </attributes>
  <tabularSections>
    <name>ВКМ_ОтпускаСотрудников</name>
    <attributes>
      <name>ВКМ_Сотрудник</name>
      <type>
        <types>CatalogRef.ВКМ_ФизическиеЛица</types>
      </type>
    </attributes>
    <attributes>
      <name>ВКМ_Должность</name>
      <type>
        <types>CatalogRef.Пользователи</types>
      </type>
    </attributes>
    <attributes>
      <name>ВКМ_ДатаНачала</name>
      <type>
        <types>Date</types>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ВКМ_ДатаОкончания</name>
      <type>
        <types>Date</types>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ВКМ_ДнейОтпуска</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ВКМ_ДнейОтпускаФакт</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

Diplom/src/Documents/ВКМ_ГрафикОтпусков/Forms/ВКМ_ФормаДокумента/Module.bsl
//{{ВКМ. 
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	//{{ВКМ. Реализуем изменение цвета строк Табличной части при отпуске более 28 календарных дней
	Для Каждого ТекСтрока Из Объект.ВКМ_ОтпускаСотрудников Цикл
		ДнейОтпуска = (ТекСтрока.ВКМ_ДатаОкончания - ТекСтрока.ВКМ_ДатаНачала) / (60 * 60 * 24);
		ТекСтрока.ВКМ_ДнейОтпуска = ДнейОтпуска;
	КонецЦикла;  
	ВКМ_ОформлениеСтроки();
	//}}ВКМ.
	
	//{{ВКМ. Добавляем команду открытия дополнительной формы документа "Анализ графика" 
	Команда = Команды.Добавить("АнализГрафика");
	Команда.Заголовок = "Анализ графика";
	Команда.Действие = "ВКМ_ОткрытьАнализГрафика";
	
	КнопкаФормы = Элементы.Добавить("АнализГрафика", Тип("КнопкаФормы"), Элементы.ВКМ_ОтпускаСотрудниковКоманднаяПанель);
	КнопкаФормы.ИмяКоманды = "АнализГрафика";
	КнопкаФормы.Вид = ВидКнопкиФормы.ОбычнаяКнопка
	//}}ВКМ
	
КонецПроцедуры   

&НаКлиенте
Процедура ВКМ_ОтпускаСотрудниковПриИзменении(Элемент) 
    
    Для Каждого ТекСтрока Из Объект.ВКМ_ОтпускаСотрудников Цикл
        ДнейОтпуска = (ТекСтрока.ВКМ_ДатаОкончания - ТекСтрока.ВКМ_ДатаНачала) / (60 * 60 * 24);
        ТекСтрока.ВКМ_ДнейОтпуска = ДнейОтпуска;
    КонецЦикла;  
    ВКМ_ОформлениеСтроки();

КонецПроцедуры

&НаСервере
Процедура ВКМ_ОформлениеСтроки()
    
    ЗначениеДляОтбора = Число("28");   
    
    ЭлементОформления = УсловноеОформление.Элементы.Добавить();
    
    ОформлениеЦветФона = ЭлементОформления.Оформление.Элементы.Найти("ЦветФона");
    ОформлениеЦветФона.Значение = WebЦвета.Кирпичный;
    ОформлениеЦветФона.Использование = Истина;
    
    ЭлементОтбора = ЭлементОформления.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
    ЭлементОтбора.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("Объект.ВКМ_ОтпускаСотрудников.ВКМ_ДнейОтпуска");
    ЭлементОтбора.ВидСравнения = ВидСравненияКомпоновкиДанных.Больше;
    ЭлементОтбора.ПравоеЗначение = ЗначениеДляОтбора;
    ЭлементОтбора.Использование = Истина;
    
    ОформляемоеПоле = ЭлементОформления.Поля.Элементы.Добавить();
    ОформляемоеПоле.Поле = Новый ПолеКомпоновкиДанных("ВКМ_ОтпускаСотрудников");
    ОформляемоеПоле.Использование = Истина;
    
КонецПроцедуры 

//{{ ВКМ. Команда открывает дополнительную форму документа "Анализ графика" 
&НаКлиенте
Процедура ВКМ_ОткрытьАнализГрафика(Команда) 
	
	СтруктураПараметров = Новый Структура;
	СтруктураПараметров.Вставить("Адрес",ПоместитьДанныеВоВременноеХранилище()); 
	ОткрытьФорму("Документ.ВКМ_ГрафикОтпусков.Форма.ВКМ_АнализГрафика", СтруктураПараметров, ЭтаФорма, Истина);

КонецПроцедуры     

//{{ ВКМ. Помещаем нужные нам данные для передачи во временно хранилище
&НаСервере
Функция ПоместитьДанныеВоВременноеХранилище() 
	
	Адрес = ПоместитьВоВременноеХранилище(Объект.ВКМ_ОтпускаСотрудников.Выгрузить(), ЭтаФорма.УникальныйИдентификатор); 
	Возврат Адрес;  
	
КонецФункции 
//}}ВКМ.
//}}ВКМ.
